app/Models/HomeModel.php

INSERT INTO `apply_job` (`name`, `email`, `contact`, `visa`, `image`) VALUES ('tessting', 'trupti.koffeekodes@gmail.com', '9924702697', 'us citizen', '/job/20220609/1654775144_7830e69e71e2479721c2.pdf')
---
    public function insert_edit_job($post,$file)
    {

        $db = $this->db;
        $builder = $db->table('apply_job');
        $pdata = array(
            'name' => $post['name'],
            'email' => $post['email'],
            'contact'=> $post['contact'],
            'visa' => $post['visa']
        );
        if ($file->isValid() && !$file->hasMoved()) {
            $original_path = '/job/' . date('Ymd') . '/';

            if (!file_exists(getcwd() . $original_path)) {
                mkdir(getcwd() . $original_path, 0777, true);
            }

            $newName = $file->getRandomName();
            $file->move(getcwd() . $original_path, $newName);

            $pdata['image'] = $original_path . $newName;
        }

        $result = $builder->insert($pdata);

SELECT *
FROM `current_openning`
WHERE `is_delete` = 0
ORDER BY `id` DESC
 LIMIT 9
---
    public function get_currentopening_list()
    {
        $db = $this->db;
        $builder = $db->table('current_openning');
        $builder->select('*');
        $builder->where(array("is_delete" => 0));
        $builder->limit(9);
        $builder->orderBy('id','DESC');
        $result = $builder->get();

SELECT *
FROM `current_openning`
WHERE `is_delete` = 0
AND `id` = '10'
---
    public function get_currentopennings_byid($id)
    {
        $db = $this->db;
        $builder = $db->table('current_openning');
        $builder->select('*');
        $builder->where(array("is_delete" => 0,"id"=>$id));
        $result = $builder->get();